<?php
require_once "../controllers/db_class/Database.php";

$db = new Database("localhost", "root", "", "ebook_project");

$results = $db->sqlQuery("
INSERT INTO `slider` (`id`, `image`) VALUES (1, '1.jpg'),(2, '2.jpg'),(3, '3.jpg');
");

$results = $db->sqlQuery("
INSERT INTO `authors` (`id`, `	author_name`,`description`) VALUES (1,'نجيب محفوظ','روائي مصري حاصل على جائزة نوبل في الأدب عام 1988.'),
(2,'غسان كنفاني','كاتب فلسطيني يُعد من أبرز الأدباء العرب في القرن العشرين.'),(3,'مصطفى صادق الرافعي','كاتب وروائي مصري، معروف بأعماله التي تمزج بين الخيال والواقع.'),
(4,'نزار قباني','شاعر ودبلوماسي سوري، كتب العديد من القصائد الرومانسية والوطنية.'),(5,'أحلام مستغانمي','روائية جزائرية معروفة بأعمالها الأدبية التي تناولت قضايا اجتماعية ونفسية.'),
(6,'عباس محمود العقاد','شاعر وناقد مصري، من أبرز الشعراء في الحركة الأدبية الحديثة في مصر.'),(7,'جبران خليل جبران','كاتب وشاعر لبناني، معروف بكتاباته التي تجمع بين الفلسفة والأدب.'),
(8,'نجوى بركات','روائية وقاصة مصرية، تميزت بأسلوبها السردي العميق والمعبر.'),(9,'توفيق الحكيم','كاتب وروائي مصري، أحد رواد الرواية العربية الحديثة في منتصف القرن العشرين.'),
(10,'نجلاء الشافعي','كاتبة وروائية مصرية، تتناول في أعمالها قضايا اجتماعية ونفسية معاصرة.')
");
